/*
 * Copyright 2012 Google Inc.
 * 
 * Licensed under the Apache License, Version 2.0 (the "License"); you may not
 * use this file except in compliance with the License. You may obtain a copy of
 * the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the
 * License for the specific language governing permissions and limitations under
 * the License.
 */
package com.google.gwt.i18n.client.impl.cldr;

import com.google.gwt.core.client.JavaScriptObject;

// DO NOT EDIT - GENERATED FROM CLDR DATA:
//  cldrVersion=21.0
//  number=$Revision: 6472 Google $
//  type=root
//  date=$Date: 2012-01-27 18:53:35 -0500 (Fri, 27 Jan 2012) $


/**
 * Localized names for the "en_Dsrt" locale.
 */
public class LocalizedNamesImpl_en_Dsrt extends LocalizedNamesImpl_en {

  @Override
  public String[] loadSortedRegionCodes() {
    return new String[] {
        "AC",
        "BQ",
        "IC",
        "CT",
        "EA",
        "CP",
        "CW",
        "DG",
        "NQ",
        "FQ",
        "JT",
        "MI",
        "VD",
        "PC",
        "PZ",
        "LC",
        "SX",
        "SS",
        "TA",
        "TN",
        "PU",
        "UA",
        "VE",
        "WK",
        "EG",
        "ET",
        "TL",
        "DD",
        "AR",
        "AM",
        "OM",
        "UZ",
        "IT",
        "IL",
        "IR",
        "IQ",
        "IN",
        "ID",
        "GQ",
        "EC",
        "EE",
        "ER",
        "SV",
        "AF",
        "AZ",
        "AX",
        "AL",
        "DZ",
        "AG",
        "AQ",
        "AD",
        "AO",
        "AI",
        "AT",
        "AU",
        "AW",
        "AS",
        "IM",
        "CI",
        "IS",
        "IE",
        "QO",
        "WF",
        "EH",
        "VI",
        "UG",
        "UM",
        "GB",
        "US",
        "AE",
        "SU",
        "YE",
        "EU",
        "UY",
        "HT",
        "HN",
        "HK",
        "HM",
        "HU",
        "YD",
        "PL",
        "PN",
        "PY",
        "PG",
        "PK",
        "PS",
        "PA",
        "PT",
        "PE",
        "PW",
        "PR",
        "BW",
        "BH",
        "BB",
        "BD",
        "BO",
        "BT",
        "BV",
        "BY",
        "BE",
        "BA",
        "BS",
        "BI",
        "BF",
        "BM",
        "BZ",
        "BG",
        "BJ",
        "BN",
        "IO",
        "VG",
        "BR",
        "TO",
        "TK",
        "TG",
        "TZ",
        "TJ",
        "TV",
        "TR",
        "TC",
        "TM",
        "TW",
        "TH",
        "TT",
        "DM",
        "DK",
        "DO",
        "CL",
        "CZ",
        "TD",
        "CN",
        "JO",
        "GE",
        "JP",
        "DJ",
        "GI",
        "JE",
        "DE",
        "JM",
        "CV",
        "KY",
        "KM",
        "CG",
        "CD",
        "CC",
        "KI",
        "KG",
        "KE",
        "CM",
        "KH",
        "CA",
        "CR",
        "KW",
        "QA",
        "KZ",
        "CO",
        "CK",
        "CU",
        "HR",
        "CX",
        "GH",
        "GN",
        "GW",
        "GM",
        "GA",
        "GG",
        "GY",
        "GP",
        "GT",
        "GU",
        "GR",
        "GL",
        "GD",
        "FJ",
        "FK",
        "PH",
        "FI",
        "FO",
        "PF",
        "GF",
        "TF",
        "FR",
        "VN",
        "VU",
        "VA",
        "SL",
        "SC",
        "SH",
        "PM",
        "BL",
        "KN",
        "VC",
        "MF",
        "SB",
        "SM",
        "SD",
        "SR",
        "SY",
        "SG",
        "SN",
        "CF",
        "RS",
        "CS",
        "SO",
        "WS",
        "CY",
        "ST",
        "SA",
        "ZA",
        "GS",
        "KR",
        "SE",
        "SZ",
        "CH",
        "ES",
        "SJ",
        "SI",
        "SK",
        "ZW",
        "ZM",
        "LK",
        "RE",
        "RO",
        "RW",
        "RU",
        "LA",
        "LY",
        "LI",
        "LT",
        "LB",
        "LV",
        "LU",
        "LS",
        "LR",
        "MM",
        "YT",
        "MQ",
        "MH",
        "ML",
        "MV",
        "MC",
        "ME",
        "MS",
        "MN",
        "MZ",
        "FX",
        "MX",
        "MG",
        "MK",
        "MU",
        "MR",
        "MT",
        "MD",
        "MO",
        "MA",
        "MY",
        "MW",
        "FM",
        "NP",
        "NR",
        "NC",
        "NZ",
        "NT",
        "NI",
        "NL",
        "AN",
        "NO",
        "NF",
        "KP",
        "MP",
        "NA",
        "NG",
        "NE",
        "NU",
    };
  }

  @Override
  protected void loadNameMapJava() {
    super.loadNameMapJava();
    namesMap.put("001", "𐐎𐐲𐑉𐑊𐐼");
    namesMap.put("002", "𐐈𐑁𐑉𐐲𐐿𐐲");
    namesMap.put("003", "𐐤𐐱𐑉𐑃 𐐊𐑋𐐯𐑉𐐲𐐿𐐲");
    namesMap.put("005", "𐐝𐐵𐑃 𐐊𐑋𐐯𐑉𐐲𐐿𐐲");
    namesMap.put("009", "𐐄𐑇𐐨𐐰𐑌𐐨𐐲");
    namesMap.put("011", "𐐎𐐯𐑅𐐻𐐲𐑉𐑌 𐐈𐑁𐑉𐐲𐐿𐐲");
    namesMap.put("013", "𐐝𐐯𐑌𐐻𐑉𐐲𐑊 𐐊𐑋𐐯𐑉𐐲𐐿𐐲");
    namesMap.put("014", "𐐀𐑅𐐻𐐲𐑉𐑌 𐐈𐑁𐑉𐐲𐐿𐐲");
    namesMap.put("015", "𐐤𐐱𐑉𐑄𐐲𐑉𐑌 𐐈𐑁𐑉𐐲𐐿𐐲");
    namesMap.put("017", "𐐣𐐮𐐼𐑊 𐐈𐑁𐑉𐐮𐐿𐐲");
    namesMap.put("018", "𐐝𐐲𐑄𐐲𐑉𐑌 𐐈𐑁𐑉𐐲𐐿𐐲");
    namesMap.put("019", "𐐊𐑋𐐯𐑉𐐲𐐿𐐲𐑆");
    namesMap.put("021", "𐐤𐐱𐑉𐑄𐐲𐑉𐑌 𐐊𐑋𐐯𐑉𐐲𐐿𐐲");
    namesMap.put("029", "𐐗𐐯𐑉𐐲𐐺𐐨𐐲𐑌");
    namesMap.put("030", "𐐀𐑅𐐻𐐲𐑉𐑌 𐐁𐑈𐐲");
    namesMap.put("034", "𐐝𐐲𐑄𐐲𐑉𐑌 𐐁𐑈𐐲");
    namesMap.put("035", "𐐝𐐵𐑃-𐐀𐑅𐐻𐐲𐑉𐑌 𐐁𐑈𐐲");
    namesMap.put("039", "𐐝𐐲𐑄𐐲𐑉𐑌 𐐏𐐲𐑉𐐲𐐹");
    namesMap.put("053", "𐐉𐑅𐐻𐑉𐐩𐑊𐐨𐐲 𐐰𐑌𐐼 𐐤𐐭 𐐞𐐨𐑊𐐲𐑌𐐼");
    namesMap.put("054", "𐐣𐐯𐑊𐐲𐑌𐐨𐑈𐐲");
    namesMap.put("057", "𐐣𐐴𐐿𐑉𐐲𐑌𐐨𐑈𐐲𐑌 𐐡𐐨𐐾𐐲𐑌");
    namesMap.put("061", "𐐑𐐪𐑊𐐲𐑌𐐨𐑈𐐲");
    namesMap.put("142", "𐐁𐑈𐐲");
    namesMap.put("143", "𐐝𐐯𐑌𐐻𐑉𐐲𐑊 𐐁𐑈𐐲");
    namesMap.put("145", "𐐎𐐯𐑅𐐻𐐲𐑉𐑌 𐐁𐑈𐐲");
    namesMap.put("150", "𐐏𐐲𐑉𐐲𐐹");
    namesMap.put("151", "𐐀𐑅𐐻𐐲𐑉𐑌 𐐏𐐲𐑉𐐲𐐹");
    namesMap.put("154", "𐐤𐐱𐑉𐑄𐐲𐑉𐑌 𐐏𐐲𐑉𐐲𐐹");
    namesMap.put("155", "𐐎𐐯𐑅𐐻𐐲𐑉𐑌 𐐏𐐲𐑉𐐲𐐹");
    namesMap.put("419", "𐐢𐐰𐐻𐑌 𐐊𐑋𐐯𐑉𐐲𐐿𐐲 𐐰𐑌𐐼 𐑄 𐐗𐐯𐑉𐐲𐐺𐐨𐐲𐑌");
    namesMap.put("AD", "𐐈𐑌𐐼𐐱𐑉𐐲");
    namesMap.put("AE", "𐐏𐐭𐑌𐐴𐐼𐐮𐐼 𐐇𐑉𐐲𐐺 𐐇𐑋𐐲𐑉𐐩𐐻𐑅");
    namesMap.put("AF", "𐐈𐑁𐑀𐐰𐑌𐐲𐑅𐐻𐐰𐑌");
    namesMap.put("AG", "𐐈𐑌𐐻𐐨𐑀𐐶𐐲 𐐰𐑌𐐼 𐐒𐐪𐑉𐐺𐐷𐐭𐐼𐐲");
    namesMap.put("AI", "𐐈𐑍𐑀𐐶𐐮𐑊𐐲");
    namesMap.put("AL", "𐐈𐑊𐐺𐐩𐑌𐐨𐐲");
    namesMap.put("AM", "𐐂𐑉𐑋𐐨𐑌𐐨𐐲");
    namesMap.put("AN", "𐐤𐐯𐑄𐐲𐑉𐑊𐐲𐑌𐐼𐑆 𐐈𐑌𐐻𐐮𐑊𐐨𐑆");
    namesMap.put("AO", "𐐈𐑌𐑀𐐬𐑊𐐲");
    namesMap.put("AQ", "𐐈𐑌𐐻𐐪𐑉𐐿𐐻𐐮𐐿𐐲");
    namesMap.put("AR", "𐐂𐑉𐐾𐐲𐑌𐐻𐐨𐑌𐐲");
    namesMap.put("AS", "𐐊𐑋𐐯𐑉𐐲𐐿𐐲𐑌 𐐝𐐲𐑋𐐬𐐲");
    namesMap.put("AT", "𐐉𐑅𐐻𐑉𐐨𐐲");
    namesMap.put("AU", "𐐉𐑅𐐻𐑉𐐩𐑊𐐨𐐲");
    namesMap.put("AW", "𐐊𐑉𐐭𐐺𐐲");
    namesMap.put("AX", "𐐈𐑊𐐰𐑌𐐼 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("AZ", "𐐈𐑆𐐲𐑉𐐺𐐴𐑈𐐪𐑌");
    namesMap.put("BA", "𐐒𐐱𐑆𐑌𐐨𐐲 𐐰𐑌𐐼 𐐐𐐲𐑉𐐻𐑅𐐲𐑀𐐬𐑂𐐨𐑌𐐲");
    namesMap.put("BB", "𐐒𐐪𐑉𐐺𐐩𐐼𐐬𐑅");
    namesMap.put("BD", "𐐒𐐪𐑍𐑀𐑊𐐲𐐼𐐯𐑇");
    namesMap.put("BE", "𐐒𐐯𐑊𐐾𐐲𐑋");
    namesMap.put("BF", "𐐒𐐲𐑉𐐿𐐩𐑌𐐲 𐐙𐐰𐑅𐐬");
    namesMap.put("BG", "𐐒𐐲𐑊𐑀𐐯𐑉𐐨𐐲");
    namesMap.put("BH", "𐐒𐐪𐑉𐐩𐑌");
    namesMap.put("BI", "𐐒𐐲𐑉𐐳𐑌𐐼𐐨");
    namesMap.put("BJ", "𐐒𐐲𐑌𐐨𐑌");
    namesMap.put("BL", "𐐝𐐩𐑌𐐻 𐐒𐐪𐑉𐐻𐐩𐑊𐐲𐑋𐐨");
    namesMap.put("BM", "𐐒𐐲𐑉𐑋𐐷𐐭𐐼𐐲");
    namesMap.put("BN", "𐐒𐑉𐐭𐑌𐐴");
    namesMap.put("BO", "𐐒𐐬𐑊𐐮𐑂𐐨𐐲");
    namesMap.put("BR", "𐐒𐑉𐐲𐑆𐐮𐑊");
    namesMap.put("BS", "𐐒𐐲𐐸𐐪𐑋𐐲𐑅");
    namesMap.put("BT", "𐐒𐐭𐐻𐐪𐑌");
    namesMap.put("BV", "𐐒𐐭𐑂𐐩 𐐌𐑊𐐲𐑌𐐼");
    namesMap.put("BW", "𐐒𐐪𐐻𐑅𐐶𐐪𐑌𐐲");
    namesMap.put("BY", "𐐒𐐯𐑊𐐲𐑉𐐭𐑅");
    namesMap.put("BZ", "𐐒𐐲𐑊𐐨𐑆");
    namesMap.put("CA", "𐐗𐐰𐑌𐐲𐐼𐐲");
    namesMap.put("CC", "𐐗𐐬𐐿𐐬𐑆 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("CD", "𐐗𐐪𐑍𐑀𐐬 - 𐐗𐐲𐑌𐑇𐐪𐑅𐐲");
    namesMap.put("CF", "𐐝𐐯𐑌𐐻𐑉𐐲𐑊 𐐈𐑁𐑉𐐲𐐿𐐲𐑌 𐐡𐐨𐐹𐐲𐐺𐑊𐐮𐐿");
    namesMap.put("CG", "𐐗𐐪𐑍𐑀𐐬 - 𐐒𐑉𐐪𐑆𐐲𐑂𐐮𐑊");
    namesMap.put("CH", "𐐝𐐶𐐮𐐻𐑅𐐲𐑉𐑊𐐲𐑌𐐼");
    namesMap.put("CI", "𐐌𐑂𐑉𐐨 𐐗𐐬𐑅𐐻");
    namesMap.put("CK", "𐐗𐐳𐐿 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("CL", "𐐕𐐨𐑊𐐩");
    namesMap.put("CM", "𐐗𐐰𐑋𐐲𐑉𐐭𐑌");
    namesMap.put("CN", "𐐕𐐴𐑌𐐲");
    namesMap.put("CO", "𐐗𐐲𐑊𐐲𐑋𐐺𐐨𐐲");
    namesMap.put("CR", "𐐗𐐱𐑅𐐻𐐲 𐐡𐐨𐐿𐐲");
    namesMap.put("CS", "𐐝𐐲𐑉𐐺𐐨𐐲 𐐰𐑌𐐼 𐐣𐐪𐑌𐐲𐑌𐐨𐑀𐑉𐐬");
    namesMap.put("CU", "𐐗𐐷𐐭𐐺𐐲");
    namesMap.put("CV", "𐐗𐐩𐐹 𐐚𐐯𐑉𐐼𐐨");
    namesMap.put("CX", "𐐗𐑉𐐮𐑅𐑋𐐲𐑅 𐐌𐑊𐐲𐑌𐐼");
    namesMap.put("CY", "𐐝𐐴𐐹𐑉𐐲𐑅");
    namesMap.put("CZ", "𐐕𐐯𐐿 𐐡𐐨𐐹𐐲𐐺𐑊𐐮𐐿");
    namesMap.put("DD", "𐐀𐑅𐐻 𐐖𐐲𐑉𐑋𐐲𐑌𐐨");
    namesMap.put("DE", "𐐖𐐲𐑉𐑋𐐲𐑌𐐨");
    namesMap.put("DJ", "𐐖𐐲𐐺𐐭𐐼𐐨");
    namesMap.put("DK", "𐐔𐐯𐑌𐑋𐐪𐑉𐐿");
    namesMap.put("DM", "𐐔𐐪𐑋𐐲𐑌𐐨𐐿𐐲");
    namesMap.put("DO", "𐐔𐐲𐑋𐐮𐑌𐐲𐐿𐐲𐑌 𐐡𐐨𐐹𐐲𐐺𐑊𐐮𐐿");
    namesMap.put("DZ", "𐐈𐑊𐐾𐐮𐑉𐐨𐐲");
    namesMap.put("EC", "𐐇𐐿𐐶𐐲𐐼𐐱𐑉");
    namesMap.put("EE", "𐐇𐑅𐐻𐐬𐑌𐐨𐐲");
    namesMap.put("EG", "𐐀𐐾𐐲𐐹𐐻");
    namesMap.put("EH", "𐐎𐐯𐑅𐐻𐐲𐑉𐑌 𐐝𐐲𐐸𐐱𐑉𐐲");
    namesMap.put("ER", "𐐇𐑉𐐮𐐻𐑉𐐨𐐲");
    namesMap.put("ES", "𐐝𐐹𐐩𐑌");
    namesMap.put("ET", "𐐀𐑃𐐨𐐬𐐹𐐨𐐲");
    namesMap.put("EU", "𐐏𐐲𐑉𐐲𐐹𐐨𐐲𐑌 𐐏𐐭𐑌𐐷𐐲𐑌");
    namesMap.put("FI", "𐐙𐐮𐑌𐑊𐐲𐑌𐐼");
    namesMap.put("FJ", "𐐙𐐨𐐾𐐨");
    namesMap.put("FK", "𐐙𐐪𐑊𐐿𐑊𐐲𐑌𐐼 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("FM", "𐐣𐐴𐐿𐑉𐐲𐑌𐐨𐑈𐐲");
    namesMap.put("FO", "𐐙𐐯𐑉𐐬 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("FR", "𐐙𐑉𐐰𐑌𐑅");
    namesMap.put("FX", "𐐣𐐯𐐻𐑉𐐲𐐹𐐪𐑊𐐲𐐻𐐲𐑌 𐐙𐑉𐐰𐑌𐑅");
    namesMap.put("GA", "𐐘𐐲𐐺𐐪𐑌");
    namesMap.put("GB", "𐐏𐐭𐑌𐐴𐐻𐐲𐐼 𐐗𐐨𐑍𐐼𐐲𐑋");
    namesMap.put("GD", "𐐘𐑉𐐲𐑌𐐩𐐼𐐲");
    namesMap.put("GE", "𐐖𐐱𐑉𐐾𐐲");
    namesMap.put("GF", "𐐙𐑉𐐯𐑌𐐽 𐐘𐐨𐐪𐑌𐐲");
    namesMap.put("GG", "𐐘𐐲𐑉𐑌𐑆𐐨");
    namesMap.put("GH", "𐐘𐐪𐑌𐐲");
    namesMap.put("GI", "𐐖𐐲𐐺𐑉𐐱𐑊𐐻𐐲𐑉");
    namesMap.put("GL", "𐐘𐑉𐐨𐑌𐑊𐐲𐑌𐐼");
    namesMap.put("GM", "𐐘𐐰𐑋𐐺𐐨𐐲");
    namesMap.put("GN", "𐐘𐐮𐑌𐐨");
    namesMap.put("GP", "𐐘𐐶𐐪𐐼𐐲𐑊𐐭𐐹");
    namesMap.put("GQ", "𐐇𐐿𐐶𐐲𐐻𐐱𐑉𐐨𐐲𐑊 𐐘𐐮𐑌𐐨");
    namesMap.put("GR", "𐐘𐑉𐐨𐑅");
    namesMap.put("GS", "𐐝𐐵𐑃 𐐖𐐱𐑉𐐾𐐲 𐐰𐑌𐐼 𐑄 𐐝𐐵𐑃 𐐝𐐰𐑌𐐼𐐶𐐮𐐽 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("GT", "𐐘𐐶𐐪𐐼𐐲𐑋𐐪𐑊𐐲");
    namesMap.put("GU", "𐐘𐐶𐐪𐑋");
    namesMap.put("GW", "𐐘𐐮𐑌𐐨-𐐒𐐮𐑅𐐵");
    namesMap.put("GY", "𐐘𐐴𐐰𐑌𐐲");
    namesMap.put("HK", "𐐐𐐬𐑍 𐐗𐐬𐑍");
    namesMap.put("HM", "𐐐𐐲𐑉𐐼 𐐌𐑊𐐲𐑌𐐼 𐐰𐑌𐐼 𐐣𐐿𐐔𐐱𐑌𐐲𐑊𐐼 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("HN", "𐐐𐐪𐑌𐐼𐐭𐑉𐐲𐑅");
    namesMap.put("HR", "𐐗𐑉𐐬𐐩𐑇𐐲");
    namesMap.put("HT", "𐐐𐐩𐐻𐐨");
    namesMap.put("HU", "𐐐𐐲𐑍𐑀𐐲𐑉𐐨");
    namesMap.put("ID", "𐐆𐑌𐐼𐐲𐑌𐐨𐑈𐐲");
    namesMap.put("IE", "𐐌𐑉𐑊𐐲𐑌𐐼");
    namesMap.put("IL", "𐐆𐑆𐑉𐐨𐐲𐑊");
    namesMap.put("IM", "𐐌𐐲𐑊 𐐲𐑁 𐐣𐐰𐑌");
    namesMap.put("IN", "𐐆𐑌𐐼𐐨𐐲");
    namesMap.put("IO", "𐐒𐑉𐐮𐐼𐐮𐑇 𐐆𐑌𐐼𐐨𐐲𐑌 𐐄𐑇𐐲𐑌 𐐓𐐯𐑉𐐲𐐻𐐱𐑉𐐨");
    namesMap.put("IQ", "𐐆𐑉𐐰𐐿");
    namesMap.put("IR", "𐐆𐑉𐐪𐑌");
    namesMap.put("IS", "𐐌𐑅𐑊𐐲𐑌𐐼");
    namesMap.put("IT", "𐐆𐐻𐐲𐑊𐐨");
    namesMap.put("JE", "𐐖𐐲𐑉𐑆𐐨");
    namesMap.put("JM", "𐐖𐐲𐑋𐐩𐐿𐐲");
    namesMap.put("JO", "𐐖𐐱𐑉𐐼𐐲𐑌");
    namesMap.put("JP", "𐐖𐐲𐐹𐐰𐑌");
    namesMap.put("KE", "𐐗𐐯𐑌𐐷𐐲");
    namesMap.put("KG", "𐐗𐐮𐑉𐑀𐐲𐑅𐐻𐐰𐑌");
    namesMap.put("KH", "𐐗𐐰𐑋𐐺𐐬𐐼𐐨𐐲");
    namesMap.put("KI", "𐐗𐐮𐑉𐐲𐐺𐐪𐐻𐐨");
    namesMap.put("KM", "𐐗𐐪𐑋𐐲𐑉𐐬𐑆");
    namesMap.put("KN", "𐐝𐐩𐑌𐐻 𐐗𐐮𐐻𐑅 𐐰𐑌𐐼 𐐤𐐨𐑂𐐮𐑅");
    namesMap.put("KP", "𐐤𐐱𐑉𐑃 𐐗𐐲𐑉𐐨𐐲");
    namesMap.put("KR", "𐐝𐐵𐑃 𐐗𐐲𐑉𐐨𐐲");
    namesMap.put("KW", "𐐗𐐲𐐶𐐩𐐻");
    namesMap.put("KY", "𐐗𐐩𐑋𐐲𐑌 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("KZ", "𐐗𐐲𐑆𐐪𐐿𐑅𐐻𐐪𐑌");
    namesMap.put("LA", "𐐢𐐪𐐬𐑅");
    namesMap.put("LB", "𐐢𐐯𐐺𐐲𐑌𐐪𐑌");
    namesMap.put("LI", "𐐢𐐮𐐿𐐻𐐲𐑌𐑅𐐻𐐴𐑌");
    namesMap.put("LK", "𐐟𐑉𐐨 𐐢𐐰𐑍𐐿𐐲");
    namesMap.put("LR", "𐐢𐐴𐐺𐐮𐑉𐐨𐐲");
    namesMap.put("LS", "𐐢𐐲𐑅𐐬𐑃𐐬");
    namesMap.put("LT", "𐐢𐐮𐑃𐐲𐐶𐐩𐑌𐐨𐐲");
    namesMap.put("LU", "𐐢𐐲𐐿𐑅𐐲𐑋𐐺𐐲𐑉𐑀");
    namesMap.put("LV", "𐐢𐐰𐐻𐑂𐐨𐐲");
    namesMap.put("LY", "𐐢𐐮𐐺𐐨𐐲");
    namesMap.put("MA", "𐐣𐐲𐑉𐐪𐐿𐐬");
    namesMap.put("MC", "𐐣𐐪𐑌𐐲𐐿𐐬");
    namesMap.put("MD", "𐐣𐐱𐑊𐐼𐐬𐑂𐐲");
    namesMap.put("ME", "𐐣𐐪𐑌𐐲𐑌𐐨𐑀𐑉𐐬");
    namesMap.put("MF", "𐐝𐐩𐑌𐐻 𐐣𐐪𐑉𐐻𐑌");
    namesMap.put("MG", "𐐣𐐰𐐼𐐲𐑀𐐰𐑅𐐿𐐲𐑉");
    namesMap.put("MH", "𐐣𐐪𐑉𐑇𐐲𐑊 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("MK", "𐐣𐐰𐑅𐐲𐐼𐐬𐑌𐐨𐐲");
    namesMap.put("ML", "𐐣𐐪𐑊𐐨");
    namesMap.put("MM", "𐐣𐐨𐐲𐑌𐑋𐐪𐑉");
    namesMap.put("MN", "𐐣𐐪𐑍𐑀𐐬𐑊𐐨𐐲");
    namesMap.put("MO", "𐐣𐐲𐐿𐐵");
    namesMap.put("MP", "𐐤𐐱𐑉𐑄𐐲𐑉𐑌 𐐣𐐰𐑉𐐨𐐱𐑌𐐲 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("MQ", "𐐣𐐪𐑉𐐻𐑌𐐨𐐿");
    namesMap.put("MR", "𐐣𐐱𐑉𐐲𐐻𐐩𐑌𐐨𐐲");
    namesMap.put("MS", "𐐣𐐪𐑌𐐻𐑅𐐲𐑉𐐪𐐻");
    namesMap.put("MT", "𐐣𐐱𐑊𐐻𐐲");
    namesMap.put("MU", "𐐣𐐱𐑉𐐮𐑇𐐲𐑅");
    namesMap.put("MV", "𐐣𐐪𐑊𐐼𐐨𐑂𐑆");
    namesMap.put("MW", "𐐣𐐲𐑊𐐪𐐶𐐨");
    namesMap.put("MX", "𐐣𐐯𐐿𐑅𐐲𐐿𐐬");
    namesMap.put("MY", "𐐣𐐲𐑊𐐩𐑈𐐲");
    namesMap.put("MZ", "𐐣𐐬𐑆𐐰𐑋𐐺𐐨𐐿");
    namesMap.put("NA", "𐐤𐐲𐑋𐐮𐐺𐐨𐐲");
    namesMap.put("NC", "𐐤𐐭 𐐗𐐰𐑊𐐲𐐼𐐬𐑌𐐷𐐲");
    namesMap.put("NE", "𐐤𐐴𐐾𐐲𐑉");
    namesMap.put("NF", "𐐤𐐱𐑉𐑁𐐲𐐿 𐐌𐑊𐐲𐑌𐐼");
    namesMap.put("NG", "𐐤𐐴𐐾𐐮𐑉𐐨𐐲");
    namesMap.put("NI", "𐐤𐐮𐐿𐐲𐑉𐐪𐑀𐐶𐐲");
    namesMap.put("NL", "𐐤𐐯𐑄𐐲𐑉𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("NO", "𐐤𐐱𐑉𐐶𐐩");
    namesMap.put("NP", "𐐤𐐩𐐹𐐪𐑊");
    namesMap.put("NR", "𐐤𐐪𐐭𐑉𐐭");
    namesMap.put("NT", "𐐤𐐭𐐻𐑉𐐲𐑊 𐐞𐐬𐑌");
    namesMap.put("NU", "𐐤𐐷𐐭𐐩");
    namesMap.put("NZ", "𐐤𐐭 𐐞𐐨𐑊𐐲𐑌𐐼");
    namesMap.put("OM", "𐐄𐑋𐐲𐑌");
    namesMap.put("PA", "𐐑𐐰𐑌𐐲𐑋𐐪");
    namesMap.put("PE", "𐐑𐐲𐑉𐐭");
    namesMap.put("PF", "𐐙𐑉𐐯𐑌𐐽 𐐑𐐪𐑊𐐲𐑌𐐨𐑈𐐲");
    namesMap.put("PG", "𐐑𐐰𐐹𐐷𐐳𐐲 𐐤𐐭 𐐘𐐮𐑌𐐨");
    namesMap.put("PH", "𐐙𐐮𐑊𐐲𐐹𐐨𐑌𐑆");
    namesMap.put("PK", "𐐑𐐰𐐿𐐲𐑅𐐻𐐰𐑌");
    namesMap.put("PL", "𐐑𐐬𐑊𐐲𐑌𐐼");
    namesMap.put("PM", "𐐝𐐩𐑌𐐻 𐐑𐐨𐐯𐑉 𐐰𐑌𐐼 𐐣𐐨𐐿𐐲𐑊𐐪𐑌");
    namesMap.put("PN", "𐐑𐐮𐐻𐐿𐐯𐑉𐑌");
    namesMap.put("PR", "𐐑𐐶𐐯𐑉𐐻𐐬 𐐡𐐨𐐿𐐬");
    namesMap.put("PS", "𐐑𐐰𐑊𐐲𐑅𐐻𐐮𐑌𐐨𐐲𐑌 𐐓𐐯𐑉𐐲𐐻𐐱𐑉𐐨");
    namesMap.put("PT", "𐐑𐐱𐑉𐐽𐐲𐑀𐐲𐑊");
    namesMap.put("PW", "𐐑𐐲𐑊𐐵");
    namesMap.put("PY", "𐐑𐐯𐑉𐐲𐑀𐐶𐐴");
    namesMap.put("QA", "𐐗𐐲𐐻𐐪𐑉");
    namesMap.put("QO", "𐐍𐐻𐑊𐐴𐐮𐑍 𐐄𐑇𐐨𐐰𐑌𐐨𐐲");
    namesMap.put("RE", "𐐡𐐨𐐷𐐭𐑌𐐷𐐲𐑌");
    namesMap.put("RO", "𐐡𐐬𐑋𐐩𐑌𐐨𐐲");
    namesMap.put("RS", "𐐝𐐲𐑉𐐺𐐨𐐲");
    namesMap.put("RU", "𐐡𐐲𐑇𐐲");
    namesMap.put("RW", "𐐡𐐲𐐶𐐪𐑌𐐼𐐲");
    namesMap.put("SA", "𐐝𐐵𐐼𐐨 𐐊𐑉𐐩𐐺𐐨𐐲");
    namesMap.put("SB", "𐐝𐐪𐑊𐐲𐑋𐐲𐑌 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("SC", "𐐝𐐩𐑇𐐯𐑊𐑆");
    namesMap.put("SD", "𐐝𐐭𐐼𐐰𐑌");
    namesMap.put("SE", "𐐝𐐶𐐨𐐼𐑌");
    namesMap.put("SG", "𐐝𐐮𐑍𐐲𐐹𐐱𐑉");
    namesMap.put("SH", "𐐝𐐩𐑌𐐻 𐐐𐐯𐑊𐐲𐑌𐐲");
    namesMap.put("SI", "𐐝𐑊𐐬𐑂𐐨𐑌𐐨𐐲");
    namesMap.put("SJ", "𐐝𐑂𐐪𐑊𐐺𐐪𐑉𐐼 𐐰𐑌𐐼 𐐖𐐰𐑌 𐐣𐐴𐐲𐑌");
    namesMap.put("SK", "𐐝𐑊𐐬𐑂𐐪𐐿𐐨𐐲");
    namesMap.put("SL", "𐐝𐐨𐐯𐑉𐐲 𐐢𐐨𐐬𐑌");
    namesMap.put("SM", "𐐝𐐪𐑌 𐐣𐐲𐑉𐐨𐑌𐐬");
    namesMap.put("SN", "𐐝𐐯𐑌𐐲𐑀𐐱𐑊");
    namesMap.put("SO", "𐐝𐐲𐑋𐐪𐑊𐐨𐐲");
    namesMap.put("SR", "𐐝𐐭𐑉𐐲𐑌𐐪𐑋");
    namesMap.put("ST", "𐐝𐐵 𐐓𐐬𐑋 𐐰𐑌𐐼 𐐑𐑉𐐮𐑌𐐽𐐮𐐹𐐩");
    namesMap.put("SU", "𐐏𐐭𐑌𐐷𐐲𐑌 𐐲𐑂 𐐝𐐬𐑂𐐨𐐯𐐻 𐐝𐐬𐑇𐐲𐑊𐐮𐑅𐐻 𐐡𐐨𐐹𐐲𐐺𐑊𐐮𐐿𐑅");
    namesMap.put("SV", "𐐇𐑊 𐐝𐐰𐑊𐑂𐐲𐐼𐐱𐑉");
    namesMap.put("SY", "𐐝𐐮𐑉𐐨𐐲");
    namesMap.put("SZ", "𐐝𐐶𐐪𐑆𐐨𐑊𐐰𐑌𐐼");
    namesMap.put("TC", "𐐓𐐲𐑉𐐿𐑅 𐐰𐑌𐐼 𐐗𐐴𐐿𐐬𐑆 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("TD", "𐐕𐐰𐐼");
    namesMap.put("TF", "𐐙𐑉𐐯𐑌𐐽 𐐝𐐲𐑄𐐲𐑉𐑌 𐐓𐐯𐑉𐐲𐐻𐐱𐑉𐐨𐑆");
    namesMap.put("TG", "𐐓𐐬𐑀𐐬");
    namesMap.put("TH", "𐐓𐐴𐑊𐐰𐑌𐐼");
    namesMap.put("TJ", "𐐓𐐲𐐾𐐨𐐿𐐲𐑅𐐻𐐰𐑌");
    namesMap.put("TK", "𐐓𐐬𐐿𐐯𐑊𐐵");
    namesMap.put("TL", "𐐀𐑅𐐻 𐐓𐐨𐑋𐐱𐑉");
    namesMap.put("TM", "𐐓𐐲𐑉𐐿𐑋𐐯𐑌𐐲𐑅𐐻𐐰𐑌");
    namesMap.put("TO", "𐐓𐐪𐑍𐑀𐐲");
    namesMap.put("TR", "𐐓𐐲𐑉𐐿𐐨");
    namesMap.put("TT", "𐐓𐑉𐐮𐑌𐐮𐐼𐐰𐐼 𐐰𐑌𐐼 𐐓𐐲𐐺𐐩𐑀𐐬");
    namesMap.put("TV", "𐐓𐐲𐑂𐐪𐑊𐐭");
    namesMap.put("TW", "𐐓𐐴𐐶𐐪𐑌");
    namesMap.put("TZ", "𐐓𐐰𐑌𐑆𐐲𐑌𐐨𐐲");
    namesMap.put("UG", "𐐏𐐭𐑀𐐰𐑌𐐼𐐲");
    namesMap.put("UM", "𐐏𐐭𐑌𐐰𐐮𐐻𐐲𐐼 𐐝𐐻𐐩𐐻𐑅 𐐣𐐴𐑌𐐬𐑉 𐐍𐐻𐑊𐐴𐐨𐑍 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("US", "𐐏𐐭𐑌𐐴𐐻𐐲𐐼 𐐝𐐻𐐩𐐻𐑅");
    namesMap.put("UY", "𐐏𐐳𐑉𐐲𐑀𐐶𐐴");
    namesMap.put("UZ", "𐐅𐑆𐐺𐐯𐐿𐐲𐑅𐐻𐐰𐑌");
    namesMap.put("VA", "𐐚𐐰𐐼𐐲𐐿𐐲𐑌");
    namesMap.put("VC", "𐐝𐐩𐑌𐐻 𐐚𐐮𐑌𐑅𐐲𐑌𐐻 𐐰𐑌𐐼 𐑄 𐐘𐑉𐐯𐑌𐐲𐐼𐐨𐑌𐑆");
    namesMap.put("VG", "𐐒𐑉𐐮𐐼𐐮𐑇 𐐚𐐲𐑉𐐾𐐲𐑌 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("VI", "𐐏.𐐝. 𐐚𐐲𐑉𐐾𐐲𐑌 𐐌𐑊𐐲𐑌𐐼𐑆");
    namesMap.put("VN", "𐐚𐐨𐐯𐐻𐑌𐐪𐑋");
    namesMap.put("VU", "𐐚𐐪𐑌𐐳𐐪𐐼𐐭");
    namesMap.put("WF", "𐐎𐐪𐑊𐐮𐑅 𐐰𐑌𐐼 𐐙𐐭𐐻𐐭𐑌𐐲");
    namesMap.put("WS", "𐐝𐐲𐑋𐐬𐐲");
    namesMap.put("YD", "𐐑𐐨𐐹𐐲𐑊𐑆 𐐔𐐯𐑋𐐲𐐿𐑉𐐰𐐼𐐮𐐿 𐐡𐐨𐐹𐐲𐐺𐑊𐐮𐐿 𐐲𐑂 𐐏𐐯𐑋𐐲𐑌");
    namesMap.put("YE", "𐐏𐐯𐑋𐐲𐑌");
    namesMap.put("YT", "𐐣𐐪𐐷𐐱𐐻");
    namesMap.put("ZA", "𐐝𐐵𐑃 𐐈𐑁𐑉𐐲𐐿𐐲");
    namesMap.put("ZM", "𐐞𐐰𐑋𐐺𐐨𐐲");
    namesMap.put("ZW", "𐐞𐐮𐑋𐐺𐐪𐐺𐐶𐐩");
    namesMap.put("ZZ", "𐐊𐑌𐐬𐑌 𐐬𐑉 𐐆𐑌𐑂𐐰𐑊𐐮𐐼 𐐡𐐨𐐾𐐲𐑌");
  }

  @Override
  protected JavaScriptObject loadNameMapNative() {
    return overrideMap(super.loadNameMapNative(), loadMyNameMap());
  }

  private native JavaScriptObject loadMyNameMap() /*-{
    return {
        "001": "𐐎𐐲𐑉𐑊𐐼",
        "002": "𐐈𐑁𐑉𐐲𐐿𐐲",
        "003": "𐐤𐐱𐑉𐑃 𐐊𐑋𐐯𐑉𐐲𐐿𐐲",
        "005": "𐐝𐐵𐑃 𐐊𐑋𐐯𐑉𐐲𐐿𐐲",
        "009": "𐐄𐑇𐐨𐐰𐑌𐐨𐐲",
        "011": "𐐎𐐯𐑅𐐻𐐲𐑉𐑌 𐐈𐑁𐑉𐐲𐐿𐐲",
        "013": "𐐝𐐯𐑌𐐻𐑉𐐲𐑊 𐐊𐑋𐐯𐑉𐐲𐐿𐐲",
        "014": "𐐀𐑅𐐻𐐲𐑉𐑌 𐐈𐑁𐑉𐐲𐐿𐐲",
        "015": "𐐤𐐱𐑉𐑄𐐲𐑉𐑌 𐐈𐑁𐑉𐐲𐐿𐐲",
        "017": "𐐣𐐮𐐼𐑊 𐐈𐑁𐑉𐐮𐐿𐐲",
        "018": "𐐝𐐲𐑄𐐲𐑉𐑌 𐐈𐑁𐑉𐐲𐐿𐐲",
        "019": "𐐊𐑋𐐯𐑉𐐲𐐿𐐲𐑆",
        "021": "𐐤𐐱𐑉𐑄𐐲𐑉𐑌 𐐊𐑋𐐯𐑉𐐲𐐿𐐲",
        "029": "𐐗𐐯𐑉𐐲𐐺𐐨𐐲𐑌",
        "030": "𐐀𐑅𐐻𐐲𐑉𐑌 𐐁𐑈𐐲",
        "034": "𐐝𐐲𐑄𐐲𐑉𐑌 𐐁𐑈𐐲",
        "035": "𐐝𐐵𐑃-𐐀𐑅𐐻𐐲𐑉𐑌 𐐁𐑈𐐲",
        "039": "𐐝𐐲𐑄𐐲𐑉𐑌 𐐏𐐲𐑉𐐲𐐹",
        "053": "𐐉𐑅𐐻𐑉𐐩𐑊𐐨𐐲 𐐰𐑌𐐼 𐐤𐐭 𐐞𐐨𐑊𐐲𐑌𐐼",
        "054": "𐐣𐐯𐑊𐐲𐑌𐐨𐑈𐐲",
        "057": "𐐣𐐴𐐿𐑉𐐲𐑌𐐨𐑈𐐲𐑌 𐐡𐐨𐐾𐐲𐑌",
        "061": "𐐑𐐪𐑊𐐲𐑌𐐨𐑈𐐲",
        "142": "𐐁𐑈𐐲",
        "143": "𐐝𐐯𐑌𐐻𐑉𐐲𐑊 𐐁𐑈𐐲",
        "145": "𐐎𐐯𐑅𐐻𐐲𐑉𐑌 𐐁𐑈𐐲",
        "150": "𐐏𐐲𐑉𐐲𐐹",
        "151": "𐐀𐑅𐐻𐐲𐑉𐑌 𐐏𐐲𐑉𐐲𐐹",
        "154": "𐐤𐐱𐑉𐑄𐐲𐑉𐑌 𐐏𐐲𐑉𐐲𐐹",
        "155": "𐐎𐐯𐑅𐐻𐐲𐑉𐑌 𐐏𐐲𐑉𐐲𐐹",
        "419": "𐐢𐐰𐐻𐑌 𐐊𐑋𐐯𐑉𐐲𐐿𐐲 𐐰𐑌𐐼 𐑄 𐐗𐐯𐑉𐐲𐐺𐐨𐐲𐑌",
        "AD": "𐐈𐑌𐐼𐐱𐑉𐐲",
        "AE": "𐐏𐐭𐑌𐐴𐐼𐐮𐐼 𐐇𐑉𐐲𐐺 𐐇𐑋𐐲𐑉𐐩𐐻𐑅",
        "AF": "𐐈𐑁𐑀𐐰𐑌𐐲𐑅𐐻𐐰𐑌",
        "AG": "𐐈𐑌𐐻𐐨𐑀𐐶𐐲 𐐰𐑌𐐼 𐐒𐐪𐑉𐐺𐐷𐐭𐐼𐐲",
        "AI": "𐐈𐑍𐑀𐐶𐐮𐑊𐐲",
        "AL": "𐐈𐑊𐐺𐐩𐑌𐐨𐐲",
        "AM": "𐐂𐑉𐑋𐐨𐑌𐐨𐐲",
        "AN": "𐐤𐐯𐑄𐐲𐑉𐑊𐐲𐑌𐐼𐑆 𐐈𐑌𐐻𐐮𐑊𐐨𐑆",
        "AO": "𐐈𐑌𐑀𐐬𐑊𐐲",
        "AQ": "𐐈𐑌𐐻𐐪𐑉𐐿𐐻𐐮𐐿𐐲",
        "AR": "𐐂𐑉𐐾𐐲𐑌𐐻𐐨𐑌𐐲",
        "AS": "𐐊𐑋𐐯𐑉𐐲𐐿𐐲𐑌 𐐝𐐲𐑋𐐬𐐲",
        "AT": "𐐉𐑅𐐻𐑉𐐨𐐲",
        "AU": "𐐉𐑅𐐻𐑉𐐩𐑊𐐨𐐲",
        "AW": "𐐊𐑉𐐭𐐺𐐲",
        "AX": "𐐈𐑊𐐰𐑌𐐼 𐐌𐑊𐐲𐑌𐐼𐑆",
        "AZ": "𐐈𐑆𐐲𐑉𐐺𐐴𐑈𐐪𐑌",
        "BA": "𐐒𐐱𐑆𐑌𐐨𐐲 𐐰𐑌𐐼 𐐐𐐲𐑉𐐻𐑅𐐲𐑀𐐬𐑂𐐨𐑌𐐲",
        "BB": "𐐒𐐪𐑉𐐺𐐩𐐼𐐬𐑅",
        "BD": "𐐒𐐪𐑍𐑀𐑊𐐲𐐼𐐯𐑇",
        "BE": "𐐒𐐯𐑊𐐾𐐲𐑋",
        "BF": "𐐒𐐲𐑉𐐿𐐩𐑌𐐲 𐐙𐐰𐑅𐐬",
        "BG": "𐐒𐐲𐑊𐑀𐐯𐑉𐐨𐐲",
        "BH": "𐐒𐐪𐑉𐐩𐑌",
        "BI": "𐐒𐐲𐑉𐐳𐑌𐐼𐐨",
        "BJ": "𐐒𐐲𐑌𐐨𐑌",
        "BL": "𐐝𐐩𐑌𐐻 𐐒𐐪𐑉𐐻𐐩𐑊𐐲𐑋𐐨",
        "BM": "𐐒𐐲𐑉𐑋𐐷𐐭𐐼𐐲",
        "BN": "𐐒𐑉𐐭𐑌𐐴",
        "BO": "𐐒𐐬𐑊𐐮𐑂𐐨𐐲",
        "BR": "𐐒𐑉𐐲𐑆𐐮𐑊",
        "BS": "𐐒𐐲𐐸𐐪𐑋𐐲𐑅",
        "BT": "𐐒𐐭𐐻𐐪𐑌",
        "BV": "𐐒𐐭𐑂𐐩 𐐌𐑊𐐲𐑌𐐼",
        "BW": "𐐒𐐪𐐻𐑅𐐶𐐪𐑌𐐲",
        "BY": "𐐒𐐯𐑊𐐲𐑉𐐭𐑅",
        "BZ": "𐐒𐐲𐑊𐐨𐑆",
        "CA": "𐐗𐐰𐑌𐐲𐐼𐐲",
        "CC": "𐐗𐐬𐐿𐐬𐑆 𐐌𐑊𐐲𐑌𐐼𐑆",
        "CD": "𐐗𐐪𐑍𐑀𐐬 - 𐐗𐐲𐑌𐑇𐐪𐑅𐐲",
        "CF": "𐐝𐐯𐑌𐐻𐑉𐐲𐑊 𐐈𐑁𐑉𐐲𐐿𐐲𐑌 𐐡𐐨𐐹𐐲𐐺𐑊𐐮𐐿",
        "CG": "𐐗𐐪𐑍𐑀𐐬 - 𐐒𐑉𐐪𐑆𐐲𐑂𐐮𐑊",
        "CH": "𐐝𐐶𐐮𐐻𐑅𐐲𐑉𐑊𐐲𐑌𐐼",
        "CI": "𐐌𐑂𐑉𐐨 𐐗𐐬𐑅𐐻",
        "CK": "𐐗𐐳𐐿 𐐌𐑊𐐲𐑌𐐼𐑆",
        "CL": "𐐕𐐨𐑊𐐩",
        "CM": "𐐗𐐰𐑋𐐲𐑉𐐭𐑌",
        "CN": "𐐕𐐴𐑌𐐲",
        "CO": "𐐗𐐲𐑊𐐲𐑋𐐺𐐨𐐲",
        "CR": "𐐗𐐱𐑅𐐻𐐲 𐐡𐐨𐐿𐐲",
        "CS": "𐐝𐐲𐑉𐐺𐐨𐐲 𐐰𐑌𐐼 𐐣𐐪𐑌𐐲𐑌𐐨𐑀𐑉𐐬",
        "CU": "𐐗𐐷𐐭𐐺𐐲",
        "CV": "𐐗𐐩𐐹 𐐚𐐯𐑉𐐼𐐨",
        "CX": "𐐗𐑉𐐮𐑅𐑋𐐲𐑅 𐐌𐑊𐐲𐑌𐐼",
        "CY": "𐐝𐐴𐐹𐑉𐐲𐑅",
        "CZ": "𐐕𐐯𐐿 𐐡𐐨𐐹𐐲𐐺𐑊𐐮𐐿",
        "DD": "𐐀𐑅𐐻 𐐖𐐲𐑉𐑋𐐲𐑌𐐨",
        "DE": "𐐖𐐲𐑉𐑋𐐲𐑌𐐨",
        "DJ": "𐐖𐐲𐐺𐐭𐐼𐐨",
        "DK": "𐐔𐐯𐑌𐑋𐐪𐑉𐐿",
        "DM": "𐐔𐐪𐑋𐐲𐑌𐐨𐐿𐐲",
        "DO": "𐐔𐐲𐑋𐐮𐑌𐐲𐐿𐐲𐑌 𐐡𐐨𐐹𐐲𐐺𐑊𐐮𐐿",
        "DZ": "𐐈𐑊𐐾𐐮𐑉𐐨𐐲",
        "EC": "𐐇𐐿𐐶𐐲𐐼𐐱𐑉",
        "EE": "𐐇𐑅𐐻𐐬𐑌𐐨𐐲",
        "EG": "𐐀𐐾𐐲𐐹𐐻",
        "EH": "𐐎𐐯𐑅𐐻𐐲𐑉𐑌 𐐝𐐲𐐸𐐱𐑉𐐲",
        "ER": "𐐇𐑉𐐮𐐻𐑉𐐨𐐲",
        "ES": "𐐝𐐹𐐩𐑌",
        "ET": "𐐀𐑃𐐨𐐬𐐹𐐨𐐲",
        "EU": "𐐏𐐲𐑉𐐲𐐹𐐨𐐲𐑌 𐐏𐐭𐑌𐐷𐐲𐑌",
        "FI": "𐐙𐐮𐑌𐑊𐐲𐑌𐐼",
        "FJ": "𐐙𐐨𐐾𐐨",
        "FK": "𐐙𐐪𐑊𐐿𐑊𐐲𐑌𐐼 𐐌𐑊𐐲𐑌𐐼𐑆",
        "FM": "𐐣𐐴𐐿𐑉𐐲𐑌𐐨𐑈𐐲",
        "FO": "𐐙𐐯𐑉𐐬 𐐌𐑊𐐲𐑌𐐼𐑆",
        "FR": "𐐙𐑉𐐰𐑌𐑅",
        "FX": "𐐣𐐯𐐻𐑉𐐲𐐹𐐪𐑊𐐲𐐻𐐲𐑌 𐐙𐑉𐐰𐑌𐑅",
        "GA": "𐐘𐐲𐐺𐐪𐑌",
        "GB": "𐐏𐐭𐑌𐐴𐐻𐐲𐐼 𐐗𐐨𐑍𐐼𐐲𐑋",
        "GD": "𐐘𐑉𐐲𐑌𐐩𐐼𐐲",
        "GE": "𐐖𐐱𐑉𐐾𐐲",
        "GF": "𐐙𐑉𐐯𐑌𐐽 𐐘𐐨𐐪𐑌𐐲",
        "GG": "𐐘𐐲𐑉𐑌𐑆𐐨",
        "GH": "𐐘𐐪𐑌𐐲",
        "GI": "𐐖𐐲𐐺𐑉𐐱𐑊𐐻𐐲𐑉",
        "GL": "𐐘𐑉𐐨𐑌𐑊𐐲𐑌𐐼",
        "GM": "𐐘𐐰𐑋𐐺𐐨𐐲",
        "GN": "𐐘𐐮𐑌𐐨",
        "GP": "𐐘𐐶𐐪𐐼𐐲𐑊𐐭𐐹",
        "GQ": "𐐇𐐿𐐶𐐲𐐻𐐱𐑉𐐨𐐲𐑊 𐐘𐐮𐑌𐐨",
        "GR": "𐐘𐑉𐐨𐑅",
        "GS": "𐐝𐐵𐑃 𐐖𐐱𐑉𐐾𐐲 𐐰𐑌𐐼 𐑄 𐐝𐐵𐑃 𐐝𐐰𐑌𐐼𐐶𐐮𐐽 𐐌𐑊𐐲𐑌𐐼𐑆",
        "GT": "𐐘𐐶𐐪𐐼𐐲𐑋𐐪𐑊𐐲",
        "GU": "𐐘𐐶𐐪𐑋",
        "GW": "𐐘𐐮𐑌𐐨-𐐒𐐮𐑅𐐵",
        "GY": "𐐘𐐴𐐰𐑌𐐲",
        "HK": "𐐐𐐬𐑍 𐐗𐐬𐑍",
        "HM": "𐐐𐐲𐑉𐐼 𐐌𐑊𐐲𐑌𐐼 𐐰𐑌𐐼 𐐣𐐿𐐔𐐱𐑌𐐲𐑊𐐼 𐐌𐑊𐐲𐑌𐐼𐑆",
        "HN": "𐐐𐐪𐑌𐐼𐐭𐑉𐐲𐑅",
        "HR": "𐐗𐑉𐐬𐐩𐑇𐐲",
        "HT": "𐐐𐐩𐐻𐐨",
        "HU": "𐐐𐐲𐑍𐑀𐐲𐑉𐐨",
        "ID": "𐐆𐑌𐐼𐐲𐑌𐐨𐑈𐐲",
        "IE": "𐐌𐑉𐑊𐐲𐑌𐐼",
        "IL": "𐐆𐑆𐑉𐐨𐐲𐑊",
        "IM": "𐐌𐐲𐑊 𐐲𐑁 𐐣𐐰𐑌",
        "IN": "𐐆𐑌𐐼𐐨𐐲",
        "IO": "𐐒𐑉𐐮𐐼𐐮𐑇 𐐆𐑌𐐼𐐨𐐲𐑌 𐐄𐑇𐐲𐑌 𐐓𐐯𐑉𐐲𐐻𐐱𐑉𐐨",
        "IQ": "𐐆𐑉𐐰𐐿",
        "IR": "𐐆𐑉𐐪𐑌",
        "IS": "𐐌𐑅𐑊𐐲𐑌𐐼",
        "IT": "𐐆𐐻𐐲𐑊𐐨",
        "JE": "𐐖𐐲𐑉𐑆𐐨",
        "JM": "𐐖𐐲𐑋𐐩𐐿𐐲",
        "JO": "𐐖𐐱𐑉𐐼𐐲𐑌",
        "JP": "𐐖𐐲𐐹𐐰𐑌",
        "KE": "𐐗𐐯𐑌𐐷𐐲",
        "KG": "𐐗𐐮𐑉𐑀𐐲𐑅𐐻𐐰𐑌",
        "KH": "𐐗𐐰𐑋𐐺𐐬𐐼𐐨𐐲",
        "KI": "𐐗𐐮𐑉𐐲𐐺𐐪𐐻𐐨",
        "KM": "𐐗𐐪𐑋𐐲𐑉𐐬𐑆",
        "KN": "𐐝𐐩𐑌𐐻 𐐗𐐮𐐻𐑅 𐐰𐑌𐐼 𐐤𐐨𐑂𐐮𐑅",
        "KP": "𐐤𐐱𐑉𐑃 𐐗𐐲𐑉𐐨𐐲",
        "KR": "𐐝𐐵𐑃 𐐗𐐲𐑉𐐨𐐲",
        "KW": "𐐗𐐲𐐶𐐩𐐻",
        "KY": "𐐗𐐩𐑋𐐲𐑌 𐐌𐑊𐐲𐑌𐐼𐑆",
        "KZ": "𐐗𐐲𐑆𐐪𐐿𐑅𐐻𐐪𐑌",
        "LA": "𐐢𐐪𐐬𐑅",
        "LB": "𐐢𐐯𐐺𐐲𐑌𐐪𐑌",
        "LI": "𐐢𐐮𐐿𐐻𐐲𐑌𐑅𐐻𐐴𐑌",
        "LK": "𐐟𐑉𐐨 𐐢𐐰𐑍𐐿𐐲",
        "LR": "𐐢𐐴𐐺𐐮𐑉𐐨𐐲",
        "LS": "𐐢𐐲𐑅𐐬𐑃𐐬",
        "LT": "𐐢𐐮𐑃𐐲𐐶𐐩𐑌𐐨𐐲",
        "LU": "𐐢𐐲𐐿𐑅𐐲𐑋𐐺𐐲𐑉𐑀",
        "LV": "𐐢𐐰𐐻𐑂𐐨𐐲",
        "LY": "𐐢𐐮𐐺𐐨𐐲",
        "MA": "𐐣𐐲𐑉𐐪𐐿𐐬",
        "MC": "𐐣𐐪𐑌𐐲𐐿𐐬",
        "MD": "𐐣𐐱𐑊𐐼𐐬𐑂𐐲",
        "ME": "𐐣𐐪𐑌𐐲𐑌𐐨𐑀𐑉𐐬",
        "MF": "𐐝𐐩𐑌𐐻 𐐣𐐪𐑉𐐻𐑌",
        "MG": "𐐣𐐰𐐼𐐲𐑀𐐰𐑅𐐿𐐲𐑉",
        "MH": "𐐣𐐪𐑉𐑇𐐲𐑊 𐐌𐑊𐐲𐑌𐐼𐑆",
        "MK": "𐐣𐐰𐑅𐐲𐐼𐐬𐑌𐐨𐐲",
        "ML": "𐐣𐐪𐑊𐐨",
        "MM": "𐐣𐐨𐐲𐑌𐑋𐐪𐑉",
        "MN": "𐐣𐐪𐑍𐑀𐐬𐑊𐐨𐐲",
        "MO": "𐐣𐐲𐐿𐐵",
        "MP": "𐐤𐐱𐑉𐑄𐐲𐑉𐑌 𐐣𐐰𐑉𐐨𐐱𐑌𐐲 𐐌𐑊𐐲𐑌𐐼𐑆",
        "MQ": "𐐣𐐪𐑉𐐻𐑌𐐨𐐿",
        "MR": "𐐣𐐱𐑉𐐲𐐻𐐩𐑌𐐨𐐲",
        "MS": "𐐣𐐪𐑌𐐻𐑅𐐲𐑉𐐪𐐻",
        "MT": "𐐣𐐱𐑊𐐻𐐲",
        "MU": "𐐣𐐱𐑉𐐮𐑇𐐲𐑅",
        "MV": "𐐣𐐪𐑊𐐼𐐨𐑂𐑆",
        "MW": "𐐣𐐲𐑊𐐪𐐶𐐨",
        "MX": "𐐣𐐯𐐿𐑅𐐲𐐿𐐬",
        "MY": "𐐣𐐲𐑊𐐩𐑈𐐲",
        "MZ": "𐐣𐐬𐑆𐐰𐑋𐐺𐐨𐐿",
        "NA": "𐐤𐐲𐑋𐐮𐐺𐐨𐐲",
        "NC": "𐐤𐐭 𐐗𐐰𐑊𐐲𐐼𐐬𐑌𐐷𐐲",
        "NE": "𐐤𐐴𐐾𐐲𐑉",
        "NF": "𐐤𐐱𐑉𐑁𐐲𐐿 𐐌𐑊𐐲𐑌𐐼",
        "NG": "𐐤𐐴𐐾𐐮𐑉𐐨𐐲",
        "NI": "𐐤𐐮𐐿𐐲𐑉𐐪𐑀𐐶𐐲",
        "NL": "𐐤𐐯𐑄𐐲𐑉𐑊𐐲𐑌𐐼𐑆",
        "NO": "𐐤𐐱𐑉𐐶𐐩",
        "NP": "𐐤𐐩𐐹𐐪𐑊",
        "NR": "𐐤𐐪𐐭𐑉𐐭",
        "NT": "𐐤𐐭𐐻𐑉𐐲𐑊 𐐞𐐬𐑌",
        "NU": "𐐤𐐷𐐭𐐩",
        "NZ": "𐐤𐐭 𐐞𐐨𐑊𐐲𐑌𐐼",
        "OM": "𐐄𐑋𐐲𐑌",
        "PA": "𐐑𐐰𐑌𐐲𐑋𐐪",
        "PE": "𐐑𐐲𐑉𐐭",
        "PF": "𐐙𐑉𐐯𐑌𐐽 𐐑𐐪𐑊𐐲𐑌𐐨𐑈𐐲",
        "PG": "𐐑𐐰𐐹𐐷𐐳𐐲 𐐤𐐭 𐐘𐐮𐑌𐐨",
        "PH": "𐐙𐐮𐑊𐐲𐐹𐐨𐑌𐑆",
        "PK": "𐐑𐐰𐐿𐐲𐑅𐐻𐐰𐑌",
        "PL": "𐐑𐐬𐑊𐐲𐑌𐐼",
        "PM": "𐐝𐐩𐑌𐐻 𐐑𐐨𐐯𐑉 𐐰𐑌𐐼 𐐣𐐨𐐿𐐲𐑊𐐪𐑌",
        "PN": "𐐑𐐮𐐻𐐿𐐯𐑉𐑌",
        "PR": "𐐑𐐶𐐯𐑉𐐻𐐬 𐐡𐐨𐐿𐐬",
        "PS": "𐐑𐐰𐑊𐐲𐑅𐐻𐐮𐑌𐐨𐐲𐑌 𐐓𐐯𐑉𐐲𐐻𐐱𐑉𐐨",
        "PT": "𐐑𐐱𐑉𐐽𐐲𐑀𐐲𐑊",
        "PW": "𐐑𐐲𐑊𐐵",
        "PY": "𐐑𐐯𐑉𐐲𐑀𐐶𐐴",
        "QA": "𐐗𐐲𐐻𐐪𐑉",
        "QO": "𐐍𐐻𐑊𐐴𐐮𐑍 𐐄𐑇𐐨𐐰𐑌𐐨𐐲",
        "RE": "𐐡𐐨𐐷𐐭𐑌𐐷𐐲𐑌",
        "RO": "𐐡𐐬𐑋𐐩𐑌𐐨𐐲",
        "RS": "𐐝𐐲𐑉𐐺𐐨𐐲",
        "RU": "𐐡𐐲𐑇𐐲",
        "RW": "𐐡𐐲𐐶𐐪𐑌𐐼𐐲",
        "SA": "𐐝𐐵𐐼𐐨 𐐊𐑉𐐩𐐺𐐨𐐲",
        "SB": "𐐝𐐪𐑊𐐲𐑋𐐲𐑌 𐐌𐑊𐐲𐑌𐐼𐑆",
        "SC": "𐐝𐐩𐑇𐐯𐑊𐑆",
        "SD": "𐐝𐐭𐐼𐐰𐑌",
        "SE": "𐐝𐐶𐐨𐐼𐑌",
        "SG": "𐐝𐐮𐑍𐐲𐐹𐐱𐑉",
        "SH": "𐐝𐐩𐑌𐐻 𐐐𐐯𐑊𐐲𐑌𐐲",
        "SI": "𐐝𐑊𐐬𐑂𐐨𐑌𐐨𐐲",
        "SJ": "𐐝𐑂𐐪𐑊𐐺𐐪𐑉𐐼 𐐰𐑌𐐼 𐐖𐐰𐑌 𐐣𐐴𐐲𐑌",
        "SK": "𐐝𐑊𐐬𐑂𐐪𐐿𐐨𐐲",
        "SL": "𐐝𐐨𐐯𐑉𐐲 𐐢𐐨𐐬𐑌",
        "SM": "𐐝𐐪𐑌 𐐣𐐲𐑉𐐨𐑌𐐬",
        "SN": "𐐝𐐯𐑌𐐲𐑀𐐱𐑊",
        "SO": "𐐝𐐲𐑋𐐪𐑊𐐨𐐲",
        "SR": "𐐝𐐭𐑉𐐲𐑌𐐪𐑋",
        "ST": "𐐝𐐵 𐐓𐐬𐑋 𐐰𐑌𐐼 𐐑𐑉𐐮𐑌𐐽𐐮𐐹𐐩",
        "SU": "𐐏𐐭𐑌𐐷𐐲𐑌 𐐲𐑂 𐐝𐐬𐑂𐐨𐐯𐐻 𐐝𐐬𐑇𐐲𐑊𐐮𐑅𐐻 𐐡𐐨𐐹𐐲𐐺𐑊𐐮𐐿𐑅",
        "SV": "𐐇𐑊 𐐝𐐰𐑊𐑂𐐲𐐼𐐱𐑉",
        "SY": "𐐝𐐮𐑉𐐨𐐲",
        "SZ": "𐐝𐐶𐐪𐑆𐐨𐑊𐐰𐑌𐐼",
        "TC": "𐐓𐐲𐑉𐐿𐑅 𐐰𐑌𐐼 𐐗𐐴𐐿𐐬𐑆 𐐌𐑊𐐲𐑌𐐼𐑆",
        "TD": "𐐕𐐰𐐼",
        "TF": "𐐙𐑉𐐯𐑌𐐽 𐐝𐐲𐑄𐐲𐑉𐑌 𐐓𐐯𐑉𐐲𐐻𐐱𐑉𐐨𐑆",
        "TG": "𐐓𐐬𐑀𐐬",
        "TH": "𐐓𐐴𐑊𐐰𐑌𐐼",
        "TJ": "𐐓𐐲𐐾𐐨𐐿𐐲𐑅𐐻𐐰𐑌",
        "TK": "𐐓𐐬𐐿𐐯𐑊𐐵",
        "TL": "𐐀𐑅𐐻 𐐓𐐨𐑋𐐱𐑉",
        "TM": "𐐓𐐲𐑉𐐿𐑋𐐯𐑌𐐲𐑅𐐻𐐰𐑌",
        "TO": "𐐓𐐪𐑍𐑀𐐲",
        "TR": "𐐓𐐲𐑉𐐿𐐨",
        "TT": "𐐓𐑉𐐮𐑌𐐮𐐼𐐰𐐼 𐐰𐑌𐐼 𐐓𐐲𐐺𐐩𐑀𐐬",
        "TV": "𐐓𐐲𐑂𐐪𐑊𐐭",
        "TW": "𐐓𐐴𐐶𐐪𐑌",
        "TZ": "𐐓𐐰𐑌𐑆𐐲𐑌𐐨𐐲",
        "UG": "𐐏𐐭𐑀𐐰𐑌𐐼𐐲",
        "UM": "𐐏𐐭𐑌𐐰𐐮𐐻𐐲𐐼 𐐝𐐻𐐩𐐻𐑅 𐐣𐐴𐑌𐐬𐑉 𐐍𐐻𐑊𐐴𐐨𐑍 𐐌𐑊𐐲𐑌𐐼𐑆",
        "US": "𐐏𐐭𐑌𐐴𐐻𐐲𐐼 𐐝𐐻𐐩𐐻𐑅",
        "UY": "𐐏𐐳𐑉𐐲𐑀𐐶𐐴",
        "UZ": "𐐅𐑆𐐺𐐯𐐿𐐲𐑅𐐻𐐰𐑌",
        "VA": "𐐚𐐰𐐼𐐲𐐿𐐲𐑌",
        "VC": "𐐝𐐩𐑌𐐻 𐐚𐐮𐑌𐑅𐐲𐑌𐐻 𐐰𐑌𐐼 𐑄 𐐘𐑉𐐯𐑌𐐲𐐼𐐨𐑌𐑆",
        "VG": "𐐒𐑉𐐮𐐼𐐮𐑇 𐐚𐐲𐑉𐐾𐐲𐑌 𐐌𐑊𐐲𐑌𐐼𐑆",
        "VI": "𐐏.𐐝. 𐐚𐐲𐑉𐐾𐐲𐑌 𐐌𐑊𐐲𐑌𐐼𐑆",
        "VN": "𐐚𐐨𐐯𐐻𐑌𐐪𐑋",
        "VU": "𐐚𐐪𐑌𐐳𐐪𐐼𐐭",
        "WF": "𐐎𐐪𐑊𐐮𐑅 𐐰𐑌𐐼 𐐙𐐭𐐻𐐭𐑌𐐲",
        "WS": "𐐝𐐲𐑋𐐬𐐲",
        "YD": "𐐑𐐨𐐹𐐲𐑊𐑆 𐐔𐐯𐑋𐐲𐐿𐑉𐐰𐐼𐐮𐐿 𐐡𐐨𐐹𐐲𐐺𐑊𐐮𐐿 𐐲𐑂 𐐏𐐯𐑋𐐲𐑌",
        "YE": "𐐏𐐯𐑋𐐲𐑌",
        "YT": "𐐣𐐪𐐷𐐱𐐻",
        "ZA": "𐐝𐐵𐑃 𐐈𐑁𐑉𐐲𐐿𐐲",
        "ZM": "𐐞𐐰𐑋𐐺𐐨𐐲",
        "ZW": "𐐞𐐮𐑋𐐺𐐪𐐺𐐶𐐩",
        "ZZ": "𐐊𐑌𐐬𐑌 𐐬𐑉 𐐆𐑌𐑂𐐰𐑊𐐮𐐼 𐐡𐐨𐐾𐐲𐑌"
    };
  }-*/;
}
